"""
Лекция 3.4.
Соглашения по оформлению кода (PEP8)
"""

"""
В python:
- переменные : с маленькой буквы, слова разделяем _
- операция, сравнение : разделяем переменные и опреаторы одним пробелом
все импорты в верхней части файла
разные курски кода - 1 перенос
разные функции разделяем 2 преносами, внутри функции тоже можно исп один перенос для разделения различных блоков
- константы капсом, разделяя свлова _
- функции и их параметры : маленькими буквами и разделяюся _
- название функции начинается с глагола
- макс число символов с троке - 80, если больше, нужно переносить часть строки ниже, чтобы код воспринимался лучше
аргументы можно разделять по одному в строчку, длинную строку переносим, взяв ее в скобки ("ghjkl")
- классы : с большой буквы CamelCase
- экземпляры класса, переменные класса : маленькие буквы, раздел слова _
- модули, пакеты : маленькие буквы, раздел слова _

Чтобы быстро привести оформление в правильный вид: Ctrl + Alt + L
"""
